/*************************************************************************
	> File Name: oj_449.cpp
	> Author: EuanXu
	> Mail: 
	> Created Time: Sat 20 Mar 2021 06:45:46 PM CST
 ************************************************************************/
#include <stdio.h>
#define N 21

	int main()
{
    int i, j, k, n=0, a[N][N];  /*定义二维数组a[14][14]*/
    scanf("%d",&n);
    for(i=1;i<=n;i++)
        a[i][1] = a[i][i] = 1;  /*两边的数令它为1，因为现在循环从1开始，就认为a[i][1]为第一个数*/
    for(i=3;i<=n;i++)
        for(j=2;j<=i-1;j++)
            a[i][j]=a[i-1][j-1]+a[i-1][j];  /*除两边的数外都等于上两顶数之和*/ 
    for(i=1;i<=n;i++){
        for(j=1;j<=i;j++)  /*j<=i的原因是不输出其它的数，只输出我们想要的数*/
			if (i == j) printf("%d",a[i][j]);
            else printf("%d ",a[i][j]);
        
        printf("\n");  /*当一行输出完以后换行继续下一行的输出*/
    }
}


